{
  "planets":[
    {
      "name": "Sun",
      "description": "The Sun is the star at the center of the Solar System. It is a nearly perfect sphere of hot plasma.",
      "description_large": "The Sun is the star at the center of the Solar System. It is a nearly perfect sphere of hot plasma and provides the energy necessary for life on Earth. The Sun's gravity holds the solar system together, keeping everything from the biggest planets to the smallest particles of debris in its orbit. It is composed primarily of hydrogen and helium undergoing nuclear fusion, which releases enormous amounts of energy.",
      "diameter_km": 1392000,
      "distance_from_sun_km": 0,
      "orbital_period_days": 0,
      "position": 0,
      "distance": 0, 
      "color": "yellow", 
      "image": "https://res.cloudinary.com/dw43hgf5p/image/upload/v1717880972/StarSystem-3_q2ei8r.png"
    },
    {
      "name": "Mercury",
      "description": "Mercury is the smallest planet in the Solar System and the closest to the Sun.",
      "description_large": "Mercury is the smallest planet in the Solar System and the closest to the Sun, orbiting at an average distance of 57.9 million kilometers. It has a very thin atmosphere, composed mostly of oxygen, sodium, and hydrogen, which cannot retain heat, causing extreme temperature variations from -173°C at night to 427°C during the day. Mercury has a large iron core that generates a magnetic field about 1% as strong as Earth's.",
      "diameter_km": 4879,
      "distance_from_sun_km": 57910000,
      "orbital_period_days": 88,
      "position": 1,
      "distance": 440, 
      "color": "gray", 
      "image": "https://res.cloudinary.com/dw43hgf5p/image/upload/v1717990801/tvpx7mned3jdjjkfsb8j.png"
    },
    {
      "name": "Venus",
      "description": "Venus is the second planet from the Sun. It is named after the Roman goddess of love and beauty.",
      "description_large": "Venus is the second planet from the Sun and has a thick, toxic atmosphere dominated by carbon dioxide, with clouds of sulfuric acid. Its surface pressure is 92 times that of Earth. Venus experiences a runaway greenhouse effect, making it the hottest planet in the Solar System with surface temperatures reaching 465°C. It rotates very slowly and in the opposite direction to most planets, with a day on Venus lasting 243 Earth days.",
      "diameter_km": 12104,
      "distance_from_sun_km": 108200000,
      "orbital_period_days": 225,
      "position": 2,
      "distance": 650, 
      "color": "yellow", 
      "image": "https://res.cloudinary.com/dw43hgf5p/image/upload/v1717880967/StarSystem-5_idco8s.png"
    },
    {
      "name": "Earth",
      "description": "Earth is the third planet from the Sun and the only astronomical object known to harbor life.",
      "description_large": "Earth is the third planet from the Sun and the only known place in the universe that harbors life. It has a diverse climate and a protective atmosphere that shields the surface from harmful solar radiation and reduces temperature extremes. Earth has abundant water in liquid form, essential for life, covering about 71% of its surface. The planet has a robust magnetic field generated by its iron core, which protects it from solar wind.",
      "diameter_km": 12742,
      "distance_from_sun_km": 149600000,
      "orbital_period_days": 365,
      "position": 3,
      "distance": 800, 
      "color": "blue", 
      "image": "https://res.cloudinary.com/dw43hgf5p/image/upload/v1717880969/StarSystem-6_vktc6m.png"
    },
    {
      "name": "Mars",
      "description": "Mars is the fourth planet from the Sun and the second-smallest planet in the Solar System.",
      "description_large": "Mars, the fourth planet from the Sun, is often called the Red Planet due to its reddish appearance, which is due to iron oxide (rust) on its surface. Mars has the largest volcano in the solar system, Olympus Mons, and a canyon system, Valles Marineris, that dwarfs the Grand Canyon. It has a thin atmosphere composed mainly of carbon dioxide, and temperatures can range from -125°C during winter at the poles to 20°C in summer.",
      "diameter_km": 6779,
      "distance_from_sun_km": 227900000,
      "orbital_period_days": 687,
      "position": 4,
      "distance": 1030, 
      "color": "red", 
      "image": "https://res.cloudinary.com/dw43hgf5p/image/upload/v1717881084/StarSystem-7_ipbwsw.png"
    },
    {
      "name": "Jupiter",
      "description": "Jupiter is the fifth planet from the Sun and the largest in the Solar System.",
      "description_large": "Jupiter is the largest planet in the Solar System, more than twice as massive as all the other planets combined. It has a Great Red Spot, a giant storm that has been raging for hundreds of years, and its atmosphere is composed mainly of hydrogen and helium. Jupiter has at least 79 moons, including the four large Galilean moons: Io, Europa, Ganymede, and Callisto. Ganymede, the largest moon, is even bigger than Mercury.",
      "diameter_km": 139820,
      "distance_from_sun_km": 778500000,
      "orbital_period_days": 4333,
      "position": 5,
      "distance": 1278, 
      "color": "orange", 
      "image": "https://res.cloudinary.com/dw43hgf5p/image/upload/v1717880975/StarSystem-8_djwuny.png"
    },
    {
      "name": "Saturn",
      "description": "Saturn is the sixth planet from the Sun and the second-largest in the Solar System.",
      "description_large": "Saturn is the sixth planet from the Sun and is famous for its extensive ring system, which is composed of ice and rock particles. Saturn is a gas giant, with an atmosphere primarily of hydrogen and helium. It has at least 83 moons, with Titan being the largest. Titan has a thick atmosphere and is the only moon in the solar system known to have stable bodies of liquid on its surface.",
      "diameter_km": 116460,
      "distance_from_sun_km": 1434000000,
      "orbital_period_days": 10759,
      "position": 6,
      "distance": 1927, 
      "color": "goldenrod", 
      "image": "https://res.cloudinary.com/dw43hgf5p/image/upload/v1717880974/StarSystem-9_ecm5m4.png"
    },
    {
      "name": "Uranus",
      "description": "Uranus is the seventh planet from the Sun. It has the third-largest planetary radius and fourth-largest planetary mass in the Solar System.",
      "description_large": "Uranus is the seventh planet from the Sun and has a unique rotation axis that is tilted sideways at an angle of about 98 degrees. This causes extreme seasonal variations as the poles take turns facing the Sun directly. Uranus has a faint ring system and a blue-green color due to methane in its atmosphere. It has at least 27 known moons, with Titania being the largest.",
      "diameter_km": 50724,
      "distance_from_sun_km": 2871000000,
      "orbital_period_days": 30687,
      "position": 7,
      "distance": 3371, 
      "color": "lightblue", 
      "image": "https://res.cloudinary.com/dw43hgf5p/image/upload/v1717880976/StarSystem-10_sma8sd.png"
    },
    {
      "name": "Neptune",
      "description": "Neptune is the eighth and farthest known Solar planet from the Sun.",
      "description_large": "Neptune, the eighth and farthest planet from the Sun, is known for its deep blue color, which is due to the presence of methane in its atmosphere. Neptune has the strongest winds in the solar system, reaching speeds of up to 2,100 km/h. It has a faint ring system and 14 known moons, with Triton being the largest. Triton is geologically active, with geysers believed to be erupting nitrogen.",
      "diameter_km": 49244,
      "distance_from_sun_km": 4495000000,
      "orbital_period_days": 60190,
      "position": 8,
      "distance": 4995, 
      "color": "blue", 
      "image":"https://res.cloudinary.com/dw43hgf5p/image/upload/v1717880973/StarSystem-11_eclbmy.png"
    }
  ]
}